[{"num_images": "45", "artist_id": 82730, "profile": "A phenomenally successful, and highly influential 1960s British guitar band, which was formed in 1960 in Liverpool, UK.\r\n\r\nThe lineup comprised John Lennon (vocals, guitar, keyboards), Paul McCartney (bass, guitar, keyboards, vocals), George Harrison (guitar, vocals), and Ringo Starr (drums, vocals). \r\n\r\nInitially a Mersey based 'beat' group with American R&B, rock & roll and country influences, by the mid-1960s the band was experimenting with psychedelia and incorporating innovative production techniques involving tape loops and other effects. \r\n\r\nThe group split-up in 1970, but the former members all pursued solo careers.  The band has continued to authorise and release albums of previously unreleased material, best of collections, live albums and remixed projects. \r\n\r\nInducted into Rock And Roll Hall of Fame in 1988 (Performer). \r\n\r\nAccording to the RIAA, the Beatles are the best-selling band in the United States, with 178 million certified units", "real_name": "Unknown", "artist_name": "Beatles, The"}, {"num_images": "0", "artist_id": 3184872, "profile": "[b]DO NOT USE.[/b]", "real_name": "Unknown", "artist_name": "Beyonce & MIssy, Monica, Bubba Sparxx"}, {"num_images": "0", "artist_id": 97334, "profile": "Unknown", "real_name": "Erik De Vries", "artist_name": "Disclosure"}, {"num_images": "9", "artist_id": 137880, "profile": "[b]Kanye Omari West[/b] (born June 8, 1977) is an American rapper, songwriter, record producer, director, entrepreneur, and fashion designer. He first gained prominence as a producer for [l=Roc-A-Fella Records]; he achieved recognition for his work on rapper [a=Jay-Z]'s [i][m=46989][/i] (2001), as well as hit singles for musical artists including [a=Alicia Keys], [a=Ludacris], and [a=Janet Jackson]. His style of production originally used high-pitched vocal samples from soul songs incorporated with his own drums and instruments. He later broadened his influences to include 1970s R&B, baroque pop, trip hop, arena rock, house, folk, alternative, electronica, synthpop, industrial, and classical music. \r\n\r\nWest released his debut album [i][m=6983][/i] in 2004 to commercial and critical acclaim and followed up with number of successful albums. He is one of the world's best-selling artists of all time, having sold more than 21 million albums and 66 million digital downloads. He has won a total of 21 Grammy Awards, making him one of the most awarded artists of all-time.", "real_name": "Kanye Omari West", "artist_name": "Kanye West"}, {"num_images": "6", "artist_id": 971243, "profile": "American singer, songwriter, businesswoman, philanthropist, and actress, born October 25, 1984 in Santa Barbara, CA, USA.\r\nShe has been nominated for several Grammy Awards and was named by Billboard as 2012's Woman of the Year.", "real_name": "Katheryn Elizabeth Hudson", "artist_name": "Katy Perry"}, {"num_images": "10", "artist_id": 1103159, "profile": "Stefani Joanne Angelina Germanotta, born March 28, 1986, better known by her stage name Lady Gaga, is an American singer, songwriter, and actress. She initially performed in theater, appearing in high school plays and studied at CAP21 through New York University's Tisch School of the Arts before dropping out to pursue a musical career. After leaving a rock band, participating in the Lower East Side's avant garde performance art circuit, and being dropped from a contract with Def Jam Recordings, Gaga worked as a songwriter for Sony/ATV Music Publishing. There, Akon noticed her vocal abilities and helped her sign a joint deal with Interscope Records and his own KonLive Distribution.\r\nGaga rose to prominence with her debut album The Fame (2008), a critical and commercial success which produced global chart-topping singles such as \"Just Dance\" and \"Poker Face\". A follow-up EP, The Fame Monster (2009), was met with similar reception and released the successful singles \"Bad Romance\", \"Telephone\", and \"Alejandro\". Her second full-length album Born This Way was released in 2011, topping the charts in more than 20 countries, including the United States, where it sold over one million copies in its first week. The album produced number one single \"Born This Way\". Her third album Artpop, released in 2013, topped the U.S. charts and included the successful singles \"Applause\" and \"Do What U Want\". In 2014, Gaga released a collaborative jazz album with Tony Bennett titled Cheek to Cheek, which debuted at number one in the United States and became her third consecutive number one album in the country.\r\nGaga is noted for her flamboyant and diverse contributions to the music industry via her fashion, live performances, and music videos. With global album and single sales of 27 million and 125 million, respectively, as of June 2014, she is one of the best-selling musicians of all time. Her achievements include five Grammy Awards, 13 MTV Video Music Awards, and 11 Guinness World Records. She regularly appears on Billboard's Artists of the Year lists and Forbes' power and earnings rankings, and was named one of the world's most influential people by Time in 2010. Outside of her music, she is noted for her philanthropic endeavors and activism for LGBT rights.\r\n\r\n\r\n\r\nLady Gaga has a Mezzo-soprano vocal type.\r\nVocal range: 2.7 octaves (C3-B5)\r\n", "real_name": "Stefani Joanne Angelina Germanotta", "artist_name": "Lady Gaga"}, {"num_images": "16", "artist_id": 8760, "profile": "[b]Madonna Louise Ciccone[/b] (born August 16, 1958) is an American singer, songwriter, actress, and businesswoman. Born in Bay City, Michigan, she moved to New York City to pursue a career in modern dance. After performing in the music groups [a=Breakfast Club] and [url=http://www.discogs.com/artist/Emmy+(7)]Emmy[/url], she signed with [l=Sire] in 1982 and released her debut album, [i][m=5319][/i], the following year. She followed it with a series of commercially successful albums and has sold more than 300 million records worldwide and is recognized as the best-selling female recording artist of all time by [i]Guinness World Records[/i]. [i]Billboard[/i] ranked her at number two on the [i]Billboard[/i] Hot 100 All-Time Top Artists, making her the most successful solo artist in the history of American singles chart.", "real_name": "Madonna Louise Ciccone", "artist_name": "Madonna"}, {"num_images": "18", "artist_id": 3840, "profile": "Radiohead is an English band from Oxfordshire, UK. Their name comes from the [a=Talking Heads] song, \"Radio Head\", from the \"[url=http://www.discogs.com/Talking-Heads-True-Stories/master/39386]True Stories[/url]\" album. \r\n\r\nFormed by school friends in 1986, Radiohead did not release their first single until 1992's \"[r=767600]\". The cathartic \"[url=http://www.discogs.com/Radiohead-Creep/master/21481]Creep[/url]\", from the debut album \"[url=http://www.discogs.com/Radiohead-Pablo-Honey/master/13344]Pablo Honey[/url]\" (1993), became a worldwide hit as grunge music dominated radio airwaves. \r\n\r\nRadiohead were initially branded as a one-hit wonder abroad, but caught on at home in the UK with their second album, \"[url=http://www.discogs.com/Radiohead-The-Bends/master/17008]The Bends[/url]\" (1995), earning fans with their dense guitar atmospheres and front man [a=Thom Yorke]'s expressive singing. The album featured the hits \"[url=http://www.discogs.com/Radiohead-High-Dry-Planet-Telex/release/199387]High & Dry[/url]\", \"[r=1463625]\" and \"[url=http://www.discogs.com/Radiohead-Fake-Plastic-Trees/master/21526]Fake Plastic Trees[/url]\". \r\n\r\nThe band's third album, \"[url=http://www.discogs.com/Radiohead-OK-Computer/master/21491]OK Computer[/url]\" (1997), propelled them to greater attention. Popular both for its expansive sound and themes of modern alienation, the album has been acclaimed by critics as a landmark record of the 1990's, some critics go as far to consider it one of the best of all time. \"[url=http://www.discogs.com/Radiohead-Kid-A/master/21501]Kid A[/url]\" (2000) marked further evolution, containing influences from experimental electronic music.\r\n\r\n\"[url=http://www.discogs.com/Radiohead-Hail-To-The-Thief/master/16962]Hail To The Thief[/url]\" (2003) was seen as a conventional return to the guitar and piano-led rock sound. After fulfilling their contract with EMI, Radiohead released \"[url=http://www.discogs.com/Radiohead-In-Rainbows/master/21520]In Rainbows[/url]\" (2007) famously via a pay-what-you-want model. Their latest album,  \"[url=http://www.discogs.com/Radiohead-The-King-Of-Limbs/master/311832]The King Of Limbs[/url]\" was released in February 2011.\r\n \r\nRadiohead's original influences were cited as alternative rock and post-punk bands like [url=http://www.discogs.com/artist/Smiths,+The]The Smiths[/url], [a=Pixies], [a=Magazine], [a=Joy Division], and [a=R.E.M.] (with lead singer of the band, Thom Yorke, refering to himself as an 'R.E.M. groupie').", "real_name": "Unknown", "artist_name": "Radiohead"}, {"num_images": "4", "artist_id": 321128, "profile": "Robyn Rihanna Fenty (born February 20, 1988), known by her stage name Rihanna, is a Barbadian recording artist, actress and fashion designer. Born in Saint Michael, Barbados, she began her career as a result of meeting record producer Evan Rogers in late 2003. At age 16, she moved to the United States to pursue a recording career and began recording demo tapes under Rogers' guidance, subsequently signing a contract with Def Jam Recordings after auditioning for Jay-Z.\r\n\r\nRihanna's debut studio album, Music of the Sun (2005), peaked at number ten on the Billboard 200 and features the Billboard Hot 100 top five hit single \"Pon de Replay\". Her second album, A Girl Like Me (2006), peaked at number five in the United States, and produced her first Hot 100 number one single, \"SOS\". Rihanna's third album, Good Girl Gone Bad (2007), spawned the international hit singles \"Umbrella\", \"Don't Stop the Music\", \"Take a Bow\", and \"Disturbia\". The album was nominated for nine Grammy Awards, winning Best Rap/Sung Collaboration for \"Umbrella\". Her fourth album, Rated R (2009), produced the top ten singles \"Russian Roulette\", \"Hard\", and \"Rude Boy\", with the latter achieving the number one spot on the Billboard Hot 100. Rihanna's fifth album, Loud (2010), spawned the number one hit singles \"Only Girl (In the World)\", \"What's My Name?\", and \"S&M\". Her sixth album, Talk That Talk (2011), served the worldwide chart topper \"We Found Love\" and the top five single \"Where Have You Been\". Rihanna's seventh album, Unapologetic (2012), was preceded by the lead single \"Diamonds\", which became Rihanna's twelfth number one on the Billboard Hot 100.\r\n\r\nRihanna's work has earned her numerous awards and accolades, including seven Grammy Awards, five American Music Awards, eighteen Billboard Music Awards and two BRIT Awards. In 2012, Rihanna was awarded by her label, Def Jam, for selling 25 million records worldwide and 75 million singles, since the beginning of her career in 2005, which makes her one of the best-selling artists of all time. She has achieved a total of twelve number one singles on the Billboard Hot 100 chart, becoming the youngest solo artist to achieve the feat. Billboard named Rihanna the Digital Songs Artist of the 2000s decade, and ranked her as the seventeenth overall artist of the same decade. In 2012, Forbes ranked her as the fourth most powerful celebrity of 2012 with earnings of $53 million between May 2011 and May 2012. The same year, American magazine Time named Rihanna one of the most influential people in the world.\r\n\r\nRihanna has a Lyric contralto vocal type.\r\nVocal Range: 3 octaves 2 notes (B2-D6)", "real_name": "Robyn Rihanna Fenty", "artist_name": "Rihanna"}, {"num_images": "5", "artist_id": 33287, "profile": "American rock band formed 1993 in Austin, Texas. The band is composed of Britt Daniel (vocals, guitar); Jim Eno (drums); Rob Pope (bass guitar, guitar, keyboards, backing vocals) and Eric Harvey (keyboard, guitar, percussion, backing vocals).", "real_name": "Unknown", "artist_name": "Spoon"}, {"num_images": "24", "artist_id": 1124645, "profile": "American singer-songwriter, born December 13, 1989 in Reading, Pennsylvania, USA. She signed her record deal with Big Machine Records at the age of 15 and released her debut album in October of 2006. \r\n\r\nSwift has written or co-written every song on her albums, with the exception of [i]Speak Now[/i] in which she is the sole writer of every song on the album. She has also released several of her songs with pop remixes and released them to pop radio, much like country-pop artist Shania Twain with whom Swift has often been compared to in both music style and fashion.\r\n\r\nSwift has collaborated with artists like Boys Like Girls, John Mayer, The Civil Wars, B.o.B., Ed Sheeran, Gary Lightbody from Snow Patrol and Tim McGraw, of whom her debut single is named after.", "real_name": "Taylor Alison Swift", "artist_name": "Taylor Swift"}]